/*==================================================================================================================\
|                                                                                                                   |
|  ░██████                                        ░██              ░█████████                                 ░██   |
| ░██   ░██                                                        ░██     ░██                                ░██   |
|░██         ░███████   ░███████  ░█████████████  ░██ ░███████     ░██     ░██  ░███████   ░██████   ░██░████ ░██   |
|░██        ░██    ░██ ░██        ░██   ░██   ░██ ░██░██    ░██    ░█████████  ░██    ░██       ░██  ░███     ░██   |
|░██        ░██    ░██  ░███████  ░██   ░██   ░██ ░██░██           ░██         ░█████████  ░███████  ░██      ░██   |
| ░██   ░██ ░██    ░██        ░██ ░██   ░██   ░██ ░██░██    ░██    ░██         ░██        ░██   ░██  ░██      ░██   |
|  ░██████   ░███████   ░███████  ░██   ░██   ░██ ░██ ░███████     ░██          ░███████   ░█████░██ ░██      ░██   |
|                                                                                                                   |
\==================================================================================================================*/


// Playing with https://x.com/YoheiNishitsuji/status/1918213871375892638

// You should probably listen to something like this while watching ^_^
// https://www.youtube.com/watch?v=FtukH_bCDHg

float sRGBencode(float C_linear) { return C_linear > 0.0031308 ? (1.055 * pow(C_linear, 1./2.4) - 0.055) : (12.92 * C_linear); }
vec3 sRGBencode(vec3 C_linear) { C_linear = clamp(C_linear, 0., 1.); return vec3(sRGBencode(C_linear.x), sRGBencode(C_linear.y), sRGBencode(C_linear.z)); }

void mainImage(out vec4 fragColor, in vec2 fragCoord) {
    
    vec3 color = texelFetch(iChannel0, ivec2(fragCoord), 0).rgb;
    vec2 uv = (2. * fragCoord.xy- iResolution.xy)/iResolution.y;
    color *= 1.-.05*dot(uv,uv);
    color = 1.-exp(-9.*pow(color, vec3(3.35)));
    color = sRGBencode(color);
    fragColor = vec4(color, 1);
}
